ci4/app/Controllers/Post.php

public function create()
{
$model = new ArtikelModel();
$data = [
'judul' => $this->request->getVar('judul'),
'isi' => $this->request->getVar('isi'),
];
$model->insert($data);
---
INSERT INTO `artikel` (`judul`, `isi`) VALUES ('Judul Artikel 5 ', NULL)

public function delete($id = null)
{
$model = new ArtikelModel();
$data = $model->where('id', $id)->delete($id);
if ($data) {
$model->delete($id);
---
DELETE FROM `artikel`
WHERE `id` = '5'
AND `id` IN ('5')
DELETE FROM `artikel`
WHERE `id` IN ('5')